import logging
from logging.handlers import RotatingFileHandler

# Создаем логгер
logger = logging.getLogger()
logger.setLevel(logging.INFO)


# Форматтер с единой структурой
formatter = logging.Formatter(
    '%(asctime)s - %(levelname)s - %(name)s - %(message)s',
    datefmt='%Y-%m-%d %H:%M:%S'
)

# # Основной обработчик для всех логов
# all_logs_handler = RotatingFileHandler(
#     'logs/all_logs.log',
#     maxBytes=5*1024*1024,  # 5 MB
#     backupCount=3,
#     encoding='utf-8'
# )
# all_logs_handler.setFormatter(formatter)

# Обработчик только для ошибок
error_handler = RotatingFileHandler(
    'logs/errors.log',
    maxBytes=5*1024*1024,
    backupCount=3,
    encoding='utf-8'
)
error_handler.setLevel(logging.ERROR)
error_handler.setFormatter(formatter)

# Консольный обработчик (опционально)
console_handler = logging.StreamHandler()
console_handler.setFormatter(formatter)

# Добавляем все обработчики
# logger.addHandler(all_logs_handler)
logger.addHandler(error_handler)
logger.addHandler(console_handler)




LIMIT_QUICK_ANSWERS = 1
LIMIT_AUTO_ANSWERS = 1
LIMIT_DAY_TEMP = {False: 3, "Pro": 10}
LIMIT_DAY_TEMP_S3 = 10
LIMIT_DELETED = 3

LIMIT_BYTES_SIZE = {False: 100 * 1024 * 1024, "Pro": 20 * 1024 * 1024 * 1024}

LIMIT_CHATS_EXCEPT = 2
KEY_ENCRYPTION = "bLRw5rCr3E5CETUU" # Код для шифрования данных, можете использовать свой

MODULES_PATH = 'modules'

VERSION = "2.0.5"


db_config = {"host": "*******", 
             "user": "*******", 
             "password": "*******", 
             "database": "*******"}

BUCKET = "*******"
s3_config = {"endpoint_url" : '*******',
    "aws_access_key_id" : '*******',
    "aws_secret_access_key" : '*******',
    "use_ssl" : True}


bot_token = "*******"
bot_id = None

modules = None
jarvis_all = {}
data_users = {}

API_ID = '*******'
API_HASH = '*******'

URL = "*******"
ARTICLE_COMMAND_URL = "*******"
CONNECT_BOT_URL = URL + "auth/index.html"
CONNECT_SMARTHOME_URL = "*******"
SUBSCRIPTION_URL = "*******"

TEXT_MAIN = f"""🌟 <b>Привет!</b> 👋
Я — умный чат-менеджер с <b>30+ мощными функциями</b>! 🔥\n
💎 <b>Топ-возможности:</b>
<blockquote expandable>🔍 <b>Слежение за сообщениями:</b>
    ├ Просмотр удалённых чатов
    ├ Просмотр изменённых сообщений
   └ Подсчёт сообщений в чатах
🛡️ <b>Безопасность:</b>
   ├ Антиспам система
   └ Быстрые ответы-предупреждения
🤖 <b>Автоматизация:</b>
   ├ Автоответчик
   ├ Умный калькулятор в сообщениях
   └ Синхронизация с Яндекс Алисой ⏳
🚀 <b>Уникальные фишки:</b>
   ├ Создание кружков из видео
   ├ Исправление раскладки
   ├ Распознавание голосовых
   ├ Облачное хранилище сообщений
   └ Ежедневный дайджест новостей\n
📚 <a href='{ARTICLE_COMMAND_URL}'>Все функции →</a> {ARTICLE_COMMAND_URL}</blockquote>\n"""

TEXT_SETTINGS = f"""🎉 <b>Добро пожаловать в главное управление мной!</b> 🤖

🔄 <u>Главный тумблер</u>:  
Включите/выключите вашего виртуального помощника <b>для всех чатов</b> одним касанием!  
<i>P.S. Не перегружайте меня задачами — даже ИИ иногда хочет кофе ☕</i>

🔤 <u>Смена префикса</u>:  
Хотите, чтобы Джарвис стал кем-то другим?  
Смените стандартный «Джарвис» по кнопке 'Изменить префикс' (только для подписчиков 🌟)

🔕 <u>Тихий режим</u>:  
Отключите автоматическую отправку постов из нашего <a href="https://t.me/jarvis_in_chat">канала</a>, если хотите меньше спойлеров и сюрпризов 🎁 (только для подписчиков 🌟)


<i>Джарвис v{VERSION}</i> 💻✨"""
